/**
 * @param {number} n
 * @return {number}
 */
let fib = function (n) {
    let a = [
        0, 1, 1, 2, 3,
        5, 8, 13, 21, 34,
        55, 89, 144, 233, 377,
        610, 987, 1597, 2584, 4181,
        6765, 10946, 17711, 28657, 46368,
        75025, 121393, 196418, 317811, 514229,
        832040
    ]

    return a[n]
}

/* 
    2021/7/29
    打表最快乐XD
    正经写的话应该是递归或滚动数组
    暴力递归会TLE，要写带备忘录的递归，保存已得到的数据
    动态数组会更省空间
    if (n < 2) {
        return n
    }
    let a = 0, b = 1, c = 1
    for (let i = 2; i <= n; i++) {
        a = b
        b = c
        c = a + b
    }
    return c
*/